app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "1"], ["author", "1"], ["content", "123"], ["created_at", "2025-12-06 22:07:59.175574"], ["updated_at", "2025-12-06 22:07:59.175574"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save