app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."nickname" = ? LIMIT ?  [["nickname", "Олег"], ["LIMIT", 1]]
---
  def create
    nickname = params[:nickname]

    if nickname.blank?
      flash[:alert] = "Будь ласка, введіть нікнейм"
      redirect_to new_session_path
      return
    end

    user = User.find_by(nickname: nickname)