app/controllers/users_controller.rb

INSERT INTO "users" ("nickname", "balance", "created_at", "updated_at", "email", "full_name") VALUES (?, ?, ?, ?, ?, ?)  [["nickname", "nick"], ["balance", 1000.0], ["created_at", "2025-12-09 18:36:19.370845"], ["updated_at", "2025-12-09 18:36:19.370845"], ["email", "nickson4@gmail.com"], ["full_name", "Nicolas"]]
---
  def create
    # Демонстрація роботи з params - зберігаємо отримані параметри для відображення
    @submitted_params = params[:user]

    @user = User.new(user_params)

    respond_to do |format|
      if @user.save